'use strict';
describe('pos',() => {
      
      
      it('购买单件商品',() => {
            let input = [
            'ITEM000000',
            ];
      spyOn(console, 'log');
      printReceipt(input);
      let result = `***<没钱赚商店>收据***
名称：可口可乐，数量：1瓶，单价：3.00(元)，小计：3.00(元)
----------------------
总计：3.00(元)
节省：0.00(元)
**********************`;
      expect(console.log).toHaveBeenCalledWith(result);
      });
      
      
      it('每种商品购买一件',() => {
            let input = [
            'ITEM000000',
            'ITEM000001',
            'ITEM000002',
            'ITEM000003',
            'ITEM000004',
            'ITEM000005',
            ];
      spyOn(console, 'log');
      printReceipt(input);
      let result = `***<没钱赚商店>收据***
名称：可口可乐，数量：1瓶，单价：3.00(元)，小计：3.00(元)
名称：雪碧，数量：1瓶，单价：3.00(元)，小计：3.00(元)
名称：苹果，数量：1斤，单价：5.50(元)，小计：5.50(元)
名称：荔枝，数量：1斤，单价：15.00(元)，小计：15.00(元)
名称：电池，数量：1个，单价：2.00(元)，小计：2.00(元)
名称：方便面，数量：1袋，单价：4.50(元)，小计：4.50(元)
----------------------
总计：33.00(元)
节省：0.00(元)
**********************`;
      expect(console.log).toHaveBeenCalledWith(result);
      });
      
      
      it('每种商品购买两件（分为顺序重复出现、乱序重复出现、以-连接)',() => {
            let input = [
            'ITEM000000',
            'ITEM000000',
            'ITEM000001',
            'ITEM000002',
            'ITEM000001',
            'ITEM000003-2',
            'ITEM000004-1',
            'ITEM000004-1',
            'ITEM000005-2',
            'ITEM000002',
            ];
      spyOn(console, 'log');
      printReceipt(input);
      let result = `***<没钱赚商店>收据***
名称：可口可乐，数量：2瓶，单价：3.00(元)，小计：6.00(元)
名称：雪碧，数量：2瓶，单价：3.00(元)，小计：6.00(元)
名称：苹果，数量：2斤，单价：5.50(元)，小计：11.00(元)
名称：荔枝，数量：2斤，单价：15.00(元)，小计：30.00(元)
名称：电池，数量：2个，单价：2.00(元)，小计：4.00(元)
名称：方便面，数量：2袋，单价：4.50(元)，小计：9.00(元)
----------------------
总计：66.00(元)
节省：0.00(元)
**********************`;
      expect(console.log).toHaveBeenCalledWith(result);
      });
      
      
      it('每种商品购买三件（分为顺序重复出现、乱序重复出现、以-连接、无优惠与有优惠)',() => {
            let input = [
            'ITEM000000',
            'ITEM000000',
            'ITEM000000',
            'ITEM000001',
            'ITEM000001-2',
            'ITEM000003',
            'ITEM000002',
            'ITEM000002',
            'ITEM000002',
            'ITEM000004-1',
            'ITEM000004-2',
            'ITEM000005-3',
            'ITEM000003-2',
            ];
      spyOn(console, 'log');
      printReceipt(input);
      let result = `***<没钱赚商店>收据***
名称：可口可乐，数量：3瓶，单价：3.00(元)，小计：6.00(元)
名称：雪碧，数量：3瓶，单价：3.00(元)，小计：6.00(元)
名称：荔枝，数量：3斤，单价：15.00(元)，小计：45.00(元)
名称：苹果，数量：3斤，单价：5.50(元)，小计：16.50(元)
名称：电池，数量：3个，单价：2.00(元)，小计：6.00(元)
名称：方便面，数量：3袋，单价：4.50(元)，小计：9.00(元)
----------------------
总计：88.50(元)
节省：10.50(元)
**********************`;
      expect(console.log).toHaveBeenCalledWith(result);
      });
      
      
      it('小数测试',() => {
            let input = [
            'ITEM000002-3.5',
            'ITEM000003-4.5',
            'ITEM000005-6',
            'ITEM000001-2',
            'ITEM000004-5',
            'ITEM000000-1',
            ];
      spyOn(console, 'log');
      printReceipt(input);
      let result = `***<没钱赚商店>收据***
名称：苹果，数量：3.5斤，单价：5.50(元)，小计：19.25(元)
名称：荔枝，数量：4.5斤，单价：15.00(元)，小计：67.50(元)
名称：方便面，数量：6袋，单价：4.50(元)，小计：18.00(元)
名称：雪碧，数量：2瓶，单价：3.00(元)，小计：6.00(元)
名称：电池，数量：5个，单价：2.00(元)，小计：10.00(元)
名称：可口可乐，数量：1瓶，单价：3.00(元)，小计：3.00(元)
----------------------
总计：123.75(元)
节省：9.00(元)
**********************`;
      expect(console.log).toHaveBeenCalledWith(result);
      });
      
      
      it('综合测试',() => {
            let input = [
            'ITEM000000',
            'ITEM000001',
            'ITEM000003-3.5',
            'ITEM000001',
            'ITEM000001',
            'ITEM000002-2',
            'ITEM000004',
            'ITEM000005-1',
            'ITEM000005-2',
            ];
      spyOn(console, 'log');
      printReceipt(input);
      let result = `***<没钱赚商店>收据***
名称：可口可乐，数量：1瓶，单价：3.00(元)，小计：3.00(元)
名称：雪碧，数量：3瓶，单价：3.00(元)，小计：6.00(元)
名称：荔枝，数量：3.5斤，单价：15.00(元)，小计：52.50(元)
名称：苹果，数量：2斤，单价：5.50(元)，小计：11.00(元)
名称：电池，数量：1个，单价：2.00(元)，小计：2.00(元)
名称：方便面，数量：3袋，单价：4.50(元)，小计：9.00(元)
----------------------
总计：83.50(元)
节省：7.50(元)
**********************`;
      expect(console.log).toHaveBeenCalledWith(result);
      });
      
      
});